personal/init.org
* Personal info
#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Jan Tomassi")
#+END_SRC

* External package
** main
#+begin_src emacs-lisp
  (require 'package)
  (package-initialize)
  (add-to-list 'package-archives
	       '("melpa" . "http://melpa.org/packages/") t) 
#+end_src

** magit
#+begin_src emacs-lisp
  (use-package magit :ensure t)
#+end_src

** autothemer
#+begin_src emacs-lisp
  (use-package autothemer :ensure t)
#+end_src

** helm
*** main
#+begin_src emacs-lisp
  (use-package helm :ensure t)
  (helm-mode)

#+end_src

*** helm-xref
#+begin_src emacs-lisp
  (use-package helm-xref :ensure t)
  (require 'helm-xref)
  (define-key global-map [remap find-file] #'helm-find-files)
  (define-key global-map [remap execute-extended-command] #'helm-M-x)
  (define-key global-map [remap switch-to-buffer] #'helm-mini)
#+end_src

** org
*** org-html
#+begin_src emacs-lisp
  (use-package htmlize :ensure t)
#+end_src

** kurecolor
#+begin_src emacs-lisp
  (use-package kurecolor :ensure t)
#+end_src

** tree-sitter
*** main
#+begin_src emacs-lisp
  (use-package tree-sitter :ensure t)

  (global-tree-sitter-mode)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)
#+end_src

*** tree-sitter-langs
#+begin_src emacs-lisp
  (use-package tree-sitter-langs :ensure t)  
#+end_src

** which-key
#+begin_src emacs-lisp
  (use-package which-key :ensure t)

  (require 'which-key)
  (which-key-mode)
  (which-key-setup-side-window-bottom)
#+end_src

** yasnippet
#+begin_src emacs-lisp
  (use-package yasnippet :ensure t)

  (require 'yasnippet)
  (yas-global-mode 1)
#+end_src

** fontify-face
#+begin_src emacs-lisp
  (use-package fontify-face :ensure t)
#+end_src

** gruvbox-theme
#+begin_src emacs-lisp
  (use-package gruvbox-theme :ensure t)
#+end_src

** company
*** main
#+begin_src emacs-lisp
  (use-package company :ensure t
    :bind
    (:map company-active-map
	  ("<tab>" . company-complete-selection))
    (:map lsp-mode-map
	  ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0)
    :hook
    (prog-mode . company-mode))
#+end_src

*** company-box
#+begin_src emacs-lisp
  (use-package company-box :ensure t
    :hook
    (company-mode . company-box-mode))
#+end_src

** lsp-mode
#+begin_src emacs-lisp
  (use-package lsp-mode :ensure t)

  (setq gc-cons-threshold (* 100 1024 1024)
	read-process-output-max (* 1024 1024)
	treemacs-space-between-root-nodes nil
	company-idle-delay 0.0
	company-minimum-prefix-length 1
	lsp-idle-delay 0.1)  ;; clangd is fast

  (with-eval-after-load 'lsp-mode
    (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration)
    (yas-global-mode))
#+end_src

* Theme
#+begin_src emacs-lisp
  (load-theme 'gruvbox-dark-hard)
#+end_src

* Set global variable
Disable the inhibit splash screen and display the line number in absolute positions
#+begin_src emacs-lisp
  (setq inhibit-splash-screen t)
  (setq column-number-mode t
	display-line-numbers 'absolute)
#+end_src

