personal/init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-13 Sat 19:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Georgios Diapoulis" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9fb9b93">1. Personal info</a></li>
<li><a href="#org85e6978">2. External package</a>
<ul>
<li><a href="#org465a2be">2.1. main</a></li>
<li><a href="#orgcb08725">2.2. autothemer</a></li>
<li><a href="#org2779fb2">2.3. helm</a>
<ul>
<li><a href="#orgdae17b3">2.3.1. main</a></li>
<li><a href="#orgf5188ea">2.3.2. helm-xref</a></li>
</ul>
</li>
<li><a href="#orgd8d6230">2.4. org</a>
<ul>
<li><a href="#orgdc9803a">2.4.1. org-html</a></li>
</ul>
</li>
<li><a href="#org045d69f">2.5. kurecolor</a></li>
<li><a href="#org16dba78">2.6. lsp-mode</a></li>
<li><a href="#org8aa8382">2.7. tree-sitter</a>
<ul>
<li><a href="#org4b8630b">2.7.1. main</a></li>
<li><a href="#org58705ff">2.7.2. tree-sitter-langs</a></li>
</ul>
</li>
<li><a href="#org77cc289">2.8. which-key</a></li>
<li><a href="#orgb4b6deb">2.9. yasnippet</a></li>
<li><a href="#org6ef2f9d">2.10. fontify-face</a></li>
<li><a href="#org04e35e7">2.11. gruvbox-theme</a></li>
<li><a href="#orgcb367d5">2.12. company</a>
<ul>
<li><a href="#org43e8332">2.12.1. main</a></li>
<li><a href="#orga002798">2.12.2. company-box</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org21353c9">3. Theme</a></li>
<li><a href="#orgb2533dc">4. Set global variable</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9fb9b93" class="outline-2">
<h2 id="org9fb9b93"><span class="section-number-2">1.</span> Personal info</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">setq</span> user-full-name <span style="color: #b8bb26;">"Jan Tomassi"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org85e6978" class="outline-2">
<h2 id="org85e6978"><span class="section-number-2">2.</span> External package</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org465a2be" class="outline-3">
<h3 id="org465a2be"><span class="section-number-3">2.1.</span> main</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">package</span>)
(package-initialize)
(add-to-list 'package-archives
             '(<span style="color: #b8bb26;">"melpa"</span> . <span style="color: #b8bb26;">"http://melpa.org/packages/"</span>) t) 
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcb08725" class="outline-3">
<h3 id="orgcb08725"><span class="section-number-3">2.2.</span> autothemer</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">autothemer</span> <span style="color: #fe8019;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2779fb2" class="outline-3">
<h3 id="org2779fb2"><span class="section-number-3">2.3.</span> helm</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgdae17b3" class="outline-4">
<h4 id="orgdae17b3"><span class="section-number-4">2.3.1.</span> main</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">helm</span> <span style="color: #fe8019;">:ensure</span> t)
(helm-mode)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf5188ea" class="outline-4">
<h4 id="orgf5188ea"><span class="section-number-4">2.3.2.</span> helm-xref</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">helm-xref</span> <span style="color: #fe8019;">:ensure</span> t)
(<span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">helm-xref</span>)
(define-key global-map [remap find-file] #'helm-find-files)
(define-key global-map [remap execute-extended-command] #'helm-M-x)
(define-key global-map [remap switch-to-buffer] #'helm-mini)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd8d6230" class="outline-3">
<h3 id="orgd8d6230"><span class="section-number-3">2.4.</span> org</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-orgdc9803a" class="outline-4">
<h4 id="orgdc9803a"><span class="section-number-4">2.4.1.</span> org-html</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">htmlize</span> <span style="color: #fe8019;">:ensure</span> t)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org045d69f" class="outline-3">
<h3 id="org045d69f"><span class="section-number-3">2.5.</span> kurecolor</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">kurecolor</span> <span style="color: #fe8019;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org16dba78" class="outline-3">
<h3 id="org16dba78"><span class="section-number-3">2.6.</span> lsp-mode</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">lsp-mode</span> <span style="color: #fe8019;">:ensure</span> t)

  (<span style="color: #fb4933;">setq</span> gc-cons-threshold (* 100 1024 1024)
        read-process-output-max (* 1024 1024)
        treemacs-space-between-root-nodes nil
<span style="color: #7c6f64;">;;</span><span style="color: #7c6f64;">      company-idle-delay 0.0</span>
<span style="color: #7c6f64;">;;</span><span style="color: #7c6f64;">      company-minimum-prefix-length 1</span>
        lsp-idle-delay 0.1)  <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">clangd is fast</span>

  (<span style="color: #fb4933;">with-eval-after-load</span> 'lsp-mode
    (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration)
    (yas-global-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8aa8382" class="outline-3">
<h3 id="org8aa8382"><span class="section-number-3">2.7.</span> tree-sitter</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org4b8630b" class="outline-4">
<h4 id="org4b8630b"><span class="section-number-4">2.7.1.</span> main</h4>
<div class="outline-text-4" id="text-2-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">tree-sitter</span> <span style="color: #fe8019;">:ensure</span> t)

(global-tree-sitter-mode)
(add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org58705ff" class="outline-4">
<h4 id="org58705ff"><span class="section-number-4">2.7.2.</span> tree-sitter-langs</h4>
<div class="outline-text-4" id="text-2-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">tree-sitter-langs</span> <span style="color: #fe8019;">:ensure</span> t)  
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org77cc289" class="outline-3">
<h3 id="org77cc289"><span class="section-number-3">2.8.</span> which-key</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">which-key</span> <span style="color: #fe8019;">:ensure</span> t)

(<span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">which-key</span>)
(which-key-mode)
(which-key-setup-side-window-bottom)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4b6deb" class="outline-3">
<h3 id="orgb4b6deb"><span class="section-number-3">2.9.</span> yasnippet</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">yasnippet</span> <span style="color: #fe8019;">:ensure</span> t)

(<span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">yasnippet</span>)
(yas-global-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ef2f9d" class="outline-3">
<h3 id="org6ef2f9d"><span class="section-number-3">2.10.</span> fontify-face</h3>
<div class="outline-text-3" id="text-2-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">fontify-face</span> <span style="color: #fe8019;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org04e35e7" class="outline-3">
<h3 id="org04e35e7"><span class="section-number-3">2.11.</span> gruvbox-theme</h3>
<div class="outline-text-3" id="text-2-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">gruvbox-theme</span> <span style="color: #fe8019;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcb367d5" class="outline-3">
<h3 id="orgcb367d5"><span class="section-number-3">2.12.</span> company</h3>
<div class="outline-text-3" id="text-2-12">
</div>
<div id="outline-container-org43e8332" class="outline-4">
<h4 id="org43e8332"><span class="section-number-4">2.12.1.</span> main</h4>
<div class="outline-text-4" id="text-2-12-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"> <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">(use-package company :ensure t</span>
 <span style="color: #7c6f64;">;;   </span><span style="color: #7c6f64;">:bind</span>
 <span style="color: #7c6f64;">;;   </span><span style="color: #7c6f64;">(:map company-active-map</span>
<span style="color: #7c6f64;">;;</span><span style="color: #7c6f64;">        ("&lt;tab&gt;" . company-complete-selection))</span>
<span style="color: #7c6f64;">;;    </span><span style="color: #7c6f64;">(:map lsp-mode-map</span>
<span style="color: #7c6f64;">;;</span><span style="color: #7c6f64;">        ("&lt;tab&gt;" . company-indent-or-complete-common))</span>
<span style="color: #7c6f64;">;;    </span><span style="color: #7c6f64;">:custom</span>
<span style="color: #7c6f64;">;;    </span><span style="color: #7c6f64;">(company-minimum-prefix-length 1)</span>
<span style="color: #7c6f64;">;;    </span><span style="color: #7c6f64;">(company-idle-delay 0.0)</span>
<span style="color: #7c6f64;">;;    </span><span style="color: #7c6f64;">:hook</span>
<span style="color: #7c6f64;">;;   </span><span style="color: #7c6f64;">(prog-mode . company-mode))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga002798" class="outline-4">
<h4 id="orga002798"><span class="section-number-4">2.12.2.</span> company-box</h4>
<div class="outline-text-4" id="text-2-12-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #7c6f64;">;;  </span><span style="color: #7c6f64;">(use-package company-box :ensure t</span>
<span style="color: #7c6f64;">;;    </span><span style="color: #7c6f64;">:hook</span>
<span style="color: #7c6f64;">;;    </span><span style="color: #7c6f64;">(company-mode . company-box-mode))</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org21353c9" class="outline-2">
<h2 id="org21353c9"><span class="section-number-2">3.</span> Theme</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(load-theme 'gruvbox-dark-hard)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb2533dc" class="outline-2">
<h2 id="orgb2533dc"><span class="section-number-2">4.</span> Set global variable</h2>
<div class="outline-text-2" id="text-4">
<p>
Disable the inhibit splash screen and display the line number in absolute positions
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #fb4933;">setq</span> inhibit-splash-screen t)
(<span style="color: #fb4933;">setq</span> column-number-mode t
      display-line-numbers 'absolute)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Georgios Diapoulis</p>
<p class="date">Created: 2023-05-13 Sat 19:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
